app/controllers/poems_controller.rb

SELECT "poems".* FROM "poems"
---
  def index
    @poems = Poem.all