app/controllers/poems_controller.rb

  def index
    @poems = Poem.where(:user_id => nil)
---
SELECT "poems".* FROM "poems" WHERE "poems"."user_id" = $1  [["user_id", 1]]

  def my_poems
    @poems = Poem.where(:user_id => current_user&.id)
---
SELECT "poems".* FROM "poems" WHERE "poems"."user_id" = $1  [["user_id", 1]]

  def create
    @poem = Poem.new(params.require(:poem).permit(:title, :text).merge(:user_id => current_user&.id))
    @poem.update(:original => @poem.text)

    @poem.save
---
INSERT INTO "poems" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def show
    @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def delete
    @poem = Poem.find(params[:poem_id])
    @poem.destroy
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "poems" WHERE "poems"."id" = ?  [["id", 1]]

  def cycle_nouns
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.cycle_nouns_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?

  def shuffle_nouns
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.shuffle_nouns_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?

  def cycle_adjectives
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.cycle_adjectives_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?

  def shuffle_adjectives
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.shuffle_adjectives_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?

  def cycle_lines
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.cycle_lines_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?

  def shuffle_lines
    @poem = Poem.find(params[:poem_id])

    if @poem.text.presence
      @poem.update(:text => PoemsHelper.shuffle_lines_in_text(@poem.text))
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "poems" SET "text" = ?, "updated_at" = ? WHERE "poems"."id" = ?